test/load/01.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

/
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 49 ms │ 125 ms │ 541 ms │ 799 ms │ 193.92 ms │ 501.57 ms │ 9995 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 1,669   │ 1,669   │ 3,617   │ 3,927   │ 3,350.2 │ 648.28 │ 1,669   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 2.45 MB │ 2.45 MB │ 5.31 MB │ 5.77 MB │ 4.92 MB │ 951 kB │ 2.45 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 66994 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 25           │
├────────────┼──────────────┤
│ 0.01       │ 28           │
├────────────┼──────────────┤
│ 0.1        │ 40           │
├────────────┼──────────────┤
│ 1          │ 45           │
├────────────┼──────────────┤
│ 2.5        │ 49           │
├────────────┼──────────────┤
│ 10         │ 66           │
├────────────┼──────────────┤
│ 25         │ 91           │
├────────────┼──────────────┤
│ 50         │ 125          │
├────────────┼──────────────┤
│ 75         │ 145          │
├────────────┼──────────────┤
│ 90         │ 293          │
├────────────┼──────────────┤
│ 97.5       │ 541          │
├────────────┼──────────────┤
│ 99         │ 799          │
├────────────┼──────────────┤
│ 99.9       │ 8155         │
├────────────┼──────────────┤
│ 99.99      │ 9840         │
├────────────┼──────────────┤
│ 99.999     │ 9995         │
└────────────┴──────────────┘

68k requests in 20.05s, 98.3 MB read
248 errors (41 timeouts)

Process finished with exit code 0