test/load/02.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

|
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 49 ms │ 128 ms │ 438 ms │ 602 ms │ 176.91 ms │ 460.78 ms │ 9974 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Req/Sec   │ 1,636  │ 1,636  │ 3,507   │ 3,911   │ 3,318.15 │ 573.05 │ 1,636  │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼────────┼────────┤
│ Bytes/Sec │ 2.4 MB │ 2.4 MB │ 5.15 MB │ 5.74 MB │ 4.87 MB  │ 841 kB │ 2.4 MB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 66353 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 4            │
├────────────┼──────────────┤
│ 0.01       │ 10           │
├────────────┼──────────────┤
│ 0.1        │ 33           │
├────────────┼──────────────┤
│ 1          │ 42           │
├────────────┼──────────────┤
│ 2.5        │ 49           │
├────────────┼──────────────┤
│ 10         │ 66           │
├────────────┼──────────────┤
│ 25         │ 93           │
├────────────┼──────────────┤
│ 50         │ 128          │
├────────────┼──────────────┤
│ 75         │ 147          │
├────────────┼──────────────┤
│ 90         │ 265          │
├────────────┼──────────────┤
│ 97.5       │ 438          │
├────────────┼──────────────┤
│ 99         │ 602          │
├────────────┼──────────────┤
│ 99.9       │ 8041         │
├────────────┼──────────────┤
│ 99.99      │ 9812         │
├────────────┼──────────────┤
│ 99.999     │ 9974         │
└────────────┴──────────────┘

67k requests in 20.09s, 97.4 MB read
153 errors (31 timeouts)

Process finished with exit code 0