test/load/03.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

|
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 57 ms │ 125 ms │ 409 ms │ 650 ms │ 161.78 ms │ 373.26 ms │ 8806 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 2,515   │ 2,515   │ 3,715   │ 3,999   │ 3,604.7 │ 370.16 │ 2,514   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 3.69 MB │ 3.69 MB │ 5.46 MB │ 5.87 MB │ 5.29 MB │ 543 kB │ 3.69 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 72082 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 26           │
├────────────┼──────────────┤
│ 0.01       │ 34           │
├────────────┼──────────────┤
│ 0.1        │ 38           │
├────────────┼──────────────┤
│ 1          │ 49           │
├────────────┼──────────────┤
│ 2.5        │ 57           │
├────────────┼──────────────┤
│ 10         │ 73           │
├────────────┼──────────────┤
│ 25         │ 108          │
├────────────┼──────────────┤
│ 50         │ 125          │
├────────────┼──────────────┤
│ 75         │ 138          │
├────────────┼──────────────┤
│ 90         │ 228          │
├────────────┼──────────────┤
│ 97.5       │ 409          │
├────────────┼──────────────┤
│ 99         │ 650          │
├────────────┼──────────────┤
│ 99.9       │ 6829         │
├────────────┼──────────────┤
│ 99.99      │ 8630         │
├────────────┼──────────────┤
│ 99.999     │ 8806         │
└────────────┴──────────────┘

73k requests in 20.08s, 106 MB read
93 errors (0 timeouts)

Process finished with exit code 0