test/load/04.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

/
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 37 ms │ 125 ms │ 506 ms │ 669 ms │ 178.45 ms │ 458.31 ms │ 9985 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 2,481   │ 2,481   │ 3,663   │ 4,047   │ 3,590.4 │ 403.13 │ 2,481   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 3.64 MB │ 3.64 MB │ 5.38 MB │ 5.94 MB │ 5.27 MB │ 592 kB │ 3.64 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 71799 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 18           │
├────────────┼──────────────┤
│ 0.01       │ 19           │
├────────────┼──────────────┤
│ 0.1        │ 26           │
├────────────┼──────────────┤
│ 1          │ 32           │
├────────────┼──────────────┤
│ 2.5        │ 37           │
├────────────┼──────────────┤
│ 10         │ 53           │
├────────────┼──────────────┤
│ 25         │ 93           │
├────────────┼──────────────┤
│ 50         │ 125          │
├────────────┼──────────────┤
│ 75         │ 142          │
├────────────┼──────────────┤
│ 90         │ 269          │
├────────────┼──────────────┤
│ 97.5       │ 506          │
├────────────┼──────────────┤
│ 99         │ 669          │
├────────────┼──────────────┤
│ 99.9       │ 8026         │
├────────────┼──────────────┤
│ 99.99      │ 9810         │
├────────────┼──────────────┤
│ 99.999     │ 9985         │
└────────────┴──────────────┘

72k requests in 20.06s, 105 MB read
199 errors (25 timeouts)

Process finished with exit code 0