test/load/05.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

\
┌─────────┬───────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼───────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 99 ms │ 153 ms │ 460 ms │ 720 ms │ 207.64 ms │ 359.24 ms │ 8221 ms │
└─────────┴───────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 1,109   │ 1,109   │ 2,951   │ 3,457   │ 2,731.55 │ 651.74 │ 1,109   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 1.63 MB │ 1.63 MB │ 4.33 MB │ 5.07 MB │ 4.01 MB  │ 956 kB │ 1.63 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 54622 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 2            │
├────────────┼──────────────┤
│ 0.01       │ 6            │
├────────────┼──────────────┤
│ 0.1        │ 18           │
├────────────┼──────────────┤
│ 1          │ 28           │
├────────────┼──────────────┤
│ 2.5        │ 99           │
├────────────┼──────────────┤
│ 10         │ 132          │
├────────────┼──────────────┤
│ 25         │ 142          │
├────────────┼──────────────┤
│ 50         │ 153          │
├────────────┼──────────────┤
│ 75         │ 181          │
├────────────┼──────────────┤
│ 90         │ 303          │
├────────────┼──────────────┤
│ 97.5       │ 460          │
├────────────┼──────────────┤
│ 99         │ 720          │
├────────────┼──────────────┤
│ 99.9       │ 6474         │
├────────────┼──────────────┤
│ 99.99      │ 8077         │
├────────────┼──────────────┤
│ 99.999     │ 8221         │
└────────────┴──────────────┘

55k requests in 20.06s, 80.2 MB read
75 errors (0 timeouts)

Process finished with exit code 0