test/load/07.txt
/opt/homebrew/bin/npm run test:cannon

> life-is-a-highway@0.0.1 test:cannon
> npx autocannon -c 500 -d 20 -w 10 --renderStatusCodes --latency --warmup [ -c 1 -d 2 ] localhost:3000/user

Running 2s warmup @ http://localhost:3000/user
1 connections
10 workers

Running 20s test @ http://localhost:3000/user
500 connections
10 workers

/
┌─────────┬────────┬────────┬────────┬────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%  │ 99%    │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼────────┼────────┼───────────┼───────────┼─────────┤
│ Latency │ 109 ms │ 145 ms │ 421 ms │ 501 ms │ 187.17 ms │ 321.25 ms │ 8239 ms │
└─────────┴────────┴────────┴────────┴────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 1,184   │ 1,184   │ 3,125   │ 3,665   │ 2,847.2 │ 760.09  │ 1,184   │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 1.74 MB │ 1.74 MB │ 4.59 MB │ 5.38 MB │ 4.18 MB │ 1.12 MB │ 1.74 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 56939 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 4            │
├────────────┼──────────────┤
│ 0.01       │ 7            │
├────────────┼──────────────┤
│ 0.1        │ 91           │
├────────────┼──────────────┤
│ 1          │ 101          │
├────────────┼──────────────┤
│ 2.5        │ 109          │
├────────────┼──────────────┤
│ 10         │ 123          │
├────────────┼──────────────┤
│ 25         │ 136          │
├────────────┼──────────────┤
│ 50         │ 145          │
├────────────┼──────────────┤
│ 75         │ 172          │
├────────────┼──────────────┤
│ 90         │ 262          │
├────────────┼──────────────┤
│ 97.5       │ 421          │
├────────────┼──────────────┤
│ 99         │ 501          │
├────────────┼──────────────┤
│ 99.9       │ 6623         │
├────────────┼──────────────┤
│ 99.99      │ 8080         │
├────────────┼──────────────┤
│ 99.999     │ 8239         │
└────────────┴──────────────┘

57k requests in 20.05s, 83.6 MB read
38 errors (0 timeouts)

Process finished with exit code 0